In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [2]:
df = pd.read_csv("house_price.csv")

In [3]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [6]:
# handling na 
import math
median_bedroom = math.floor(df.bedrooms.median())
median_bedroom

4

In [9]:
df.bedrooms.fillna(median_bedroom, inplace = True)

In [10]:
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [11]:
reg = linear_model.LinearRegression()
reg.fit(df[['area', 'bedrooms', 'age']], df.price)

LinearRegression()

In [12]:
reg.coef_

array([  112.06244194, 23388.88007794, -3231.71790863])

In [13]:
reg.intercept_

221323.00186540437

In [14]:
reg.predict([[3000, 3, 40]])

D:\Learning\mvenv\lib\site-packages\sklearn\base.py:409: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([498408.25158031])

In [15]:
df['predicted_op'] = reg.predict(df[['area', 'bedrooms', 'age']])

In [16]:
df

   area  bedrooms  age   price   predicted_op
0  2600       3.0   20  550000  518217.632976
1  3000       4.0   15  565000  602590.079374
2  3200       4.0   18  610000  615307.414037
3  3600       3.0   30  595000  597962.895832
4  4000       5.0    8  760000  760663.426755
5  4100       6.0    8  810000  795258.551027

In [17]:
df['diff'] = df['price'] - df['predicted_op']
df

   area  bedrooms  age   price   predicted_op          diff
0  2600       3.0   20  550000  518217.632976  31782.367024
1  3000       4.0   15  565000  602590.079374 -37590.079374
2  3200       4.0   18  610000  615307.414037  -5307.414037
3  3600       3.0   30  595000  597962.895832  -2962.895832
4  4000       5.0    8  760000  760663.426755   -663.426755
5  4100       6.0    8  810000  795258.551027  14741.448973

Exercise

In [19]:
df1 = pd.read_csv('hiring_data.csv')
df1

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [26]:
from word2number import w2n

In [29]:
df1['experience'] = df1['experience'].fillna("zero")
df1['experience_1'] = df1.experience.apply(w2n.word_to_num)

In [30]:
df1

,experience,test_score(out of 10),interview_score(out of 10),salary($),experience_1
0,zero,8.0,9,50000,0
1,zero,8.0,6,45000,0
2,five,6.0,7,60000,5
3,two,10.0,10,65000,2
4,seven,9.0,6,70000,7
5,three,7.0,10,62000,3
6,ten,NaN,7,72000,10
7,eleven,7.0,8,80000,11

In [33]:
df1['test_score(out of 10)'].fillna(df1['test_score(out of 10)'].median(), inplace= True)
df1

,experience,test_score(out of 10),interview_score(out of 10),salary($),experience_1
0,zero,8.0,9,50000,0
1,zero,8.0,6,45000,0
2,five,6.0,7,60000,5
3,two,10.0,10,65000,2
4,seven,9.0,6,70000,7
5,three,7.0,10,62000,3
6,ten,8.0,7,72000,10
7,eleven,7.0,8,80000,11

In [34]:
reg = linear_model.LinearRegression()
reg.fit(df1[['experience_1', 'test_score(out of 10)', 'interview_score(out of 10)']], df1['salary($)'])

LinearRegression()

In [35]:
df1['pred_sal'] = reg.predict(df1[['experience_1', 'test_score(out of 10)', 'interview_score(out of 10)']])
df1

,experience,test_score(out of 10),interview_score(out of 10),salary($),experience_1,pred_sal
0,zero,8.0,9,50000,0,52350.072780
1,zero,8.0,6,45000,0,45734.352256
2,five,6.0,7,60000,5,58312.954876
3,two,10.0,10,65000,2,63872.634643
4,seven,9.0,6,70000,7,67270.742358
5,three,7.0,10,62000,3,61148.471616
6,ten,8.0,7,72000,10,76069.141194
7,eleven,7.0,8,80000,11,79241.630277

In [36]:
df1['diff'] = df1['salary($)'] - df1['pred_sal']
df1

,experience,test_score(out of 10),interview_score(out of 10),salary($),experience_1,pred_sal,diff
0,zero,8.0,9,50000,0,52350.072780,-2350.072780
1,zero,8.0,6,45000,0,45734.352256,-734.352256
2,five,6.0,7,60000,5,58312.954876,1687.045124
3,two,10.0,10,65000,2,63872.634643,1127.365357
4,seven,9.0,6,70000,7,67270.742358,2729.257642
5,three,7.0,10,62000,3,61148.471616,851.528384
6,ten,8.0,7,72000,10,76069.141194,-4069.141194
7,eleven,7.0,8,80000,11,79241.630277,758.369723